Tekla Open API Reference for Tekla Structures 2025
Operation.SplitSlab Method
 This command is meant for specifically splitting a concrete slab with advanced solid operations to create more robust and user friendly results than the command: public static ContourPlate Split(ContourPlate Object, Polygon SplitPolygon). No validation is done for the type, it is the caller's responsibility to call this only for valid types (slabs). Behavior for non-slabs is undetermined.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SplitSlab(
	int PartId,
	FacetedBrep Polymesh
)
Public Shared Function SplitSlab (
	PartId As Integer,
	Polymesh As FacetedBrep
) As Boolean
Parameters
PartId
Type: System.Int32
The part ID that identifies the slab to be split
Polymesh
Type: Tekla.Structures.Geometry3d.FacetedBrep
The polymesh that defines the splitting surface
Return Value
Type: Boolean
True on success.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace